//Задача 6
//Проверка числа на чётность

Console.WriteLine("Введи число : ");
int a = Convert.ToInt32(Console.ReadLine());
if (a % 2 == 0) Console.WriteLine("Четное");
else Console.WriteLine("Нечетное");